// 1. Поиск в интернете (бесплатные api примеры).
// 2. Найти любые данные, на произвольную тему.
// 3. Создать файл data.js.
// 4. Создать переменную которая будет хранить данные из публичных api.

export const dataInfo = `
[
    {
      "conditions": "Предложения действительны для Москвы, Переславль-Залесского и Костромской области. Информацию об ассортименте товаров, участвующих в акции, уточняйте в магазине. Количество товаров ограничено, не является публичной офертой.",
      "date_end": "2020-06-12",
      "date_start": "2020-06-05",
      "id": "1234",
      "image": "https://img-fotki.yandex.ru/get/195195/30348152.208/0_909df_68cc6bfb_orig",
      "is_main": true,
      "offers": [
        "11111",
        "22222",
        "33333"
      ],
      "target_regions": [
        "Россия, Москва",
        "Россия, Ярославская область, Переславль-Залесский",
        "Россия, Костромская область, Островский район, село Адищево"
      ]
    },
    {
      "conditions": "Предложения действительны в магазине по адресу: Владимир, улица Куйбышева, 26К",
      "date_end": "2020-06-12",
      "date_start": "2020-06-05",
      "id": "5678",
      "image": "https://ptzgovorit.ru/sites/default/files/original_nodes/moscva-city_8.jpg",
      "is_main": true,
      "offers": [
        "22222",
        "33333"
      ],
      "target_regions": [
        "Владимир, улица Куйбышева, 26К"
      ]
    },
    {
        "conditions": "Предложения действительны в магазине по адресу: Владимир, улица Куйбышева, 26К",
        "date_end": "2020-06-12",
        "date_start": "2020-06-05",
        "id": "5678",
        "image": "http://ucare.timepad.ru/1d49a4d9-0728-4637-85d7-64c10aa0d96f/poster_event_1380765.jpg",
        "is_main": true,
        "offers": [
          "22222",
          "33333"
        ],
        "target_regions": [
          "Владимир, улица Куйбышева, 26К"
        ]
      },
      {
        "conditions": "Предложения действительны в магазине по адресу: Владимир, улица Куйбышева, 26К",
        "date_end": "2020-06-12",
        "date_start": "2020-06-05",
        "id": "5678",
        "image": "https://mtdata.ru/u29/photoB7DF/20764115674-0/original.jpg",
        "is_main": true,
        "offers": [
          "22222",
          "33333"
        ],
        "target_regions": [
          "Владимир, улица Куйбышева, 26К"
        ]
      },
      {
        "conditions": "Предложения действительны в магазине по адресу: Владимир, улица Куйбышева, 26К",
        "date_end": "2020-06-12",
        "date_start": "2020-06-05",
        "id": "5678",
        "image": "https://img5.goodfon.ru/original/1680x1050/4/f6/marina-cheskis-moskva-rossiia-moskva-reka-bolshoi-krasnokhol.jpg",
        "is_main": true,
        "offers": [
          "22222",
          "33333"
        ],
        "target_regions": [
          "Владимир, улица Куйбышева, 26К"
        ]
      },
      {
        "conditions": "Предложения действительны в магазине по адресу: Владимир, улица Куйбышева, 26К",
        "date_end": "2020-06-12",
        "date_start": "2020-06-05",
        "id": "5678",
        "image": "https://barcaffe.ru/wp-content/uploads/2020/05/00_arkh.jpg",
        "is_main": true,
        "offers": [
          "22222",
          "33333"
        ],
        "target_regions": [
          "Владимир, улица Куйбышева, 26К"
        ]
      },
      {
        "conditions": "Предложения действительны в магазине по адресу: Владимир, улица Куйбышева, 26К",
        "date_end": "2020-06-12",
        "date_start": "2020-06-05",
        "id": "5678",
        "image": "https://патриотам.рф/wp-content/uploads/2014/10/0011.jpg",
        "is_main": true,
        "offers": [
          "22222",
          "33333"
        ],
        "target_regions": [
          "Владимир, улица Куйбышева, 26К"
        ]
      },
      {
        "conditions": "Предложения действительны в магазине по адресу: Владимир, улица Куйбышева, 26К",
        "date_end": "2020-06-12",
        "date_start": "2020-06-05",
        "id": "5678",
        "image": "https://img.fonwall.ru/o/5p/russia-moscow-moscow-kremlin-rossiya-ogn1.jpg",
        "is_main": true,
        "offers": [
          "22222",
          "33333"
        ],
        "target_regions": [
          "Владимир, улица Куйбышева, 26К"
        ]
      },
      {
        "conditions": "Предложения действительны в магазине по адресу: Владимир, улица Куйбышева, 26К",
        "date_end": "2020-06-12",
        "date_start": "2020-06-05",
        "id": "5678",
        "image": "https://s1.1zoom.ru/b4858/854/Moscow_Kremlin_Bridges_Russia_Night_533239_2560x1440.jpg",
        "is_main": true,
        "offers": [
          "22222",
          "33333"
        ],
        "target_regions": [
          "Владимир, улица Куйбышева, 26К"
        ]
      }
  ]`;
